
//民族列表
export const NATIONS = [
  '汉族',
  '蒙古族',
  '回族',
  '藏族',
  '维吾尔族',
  '苗族',
  '彝族',
  '壮族',
  '布依族',
  '朝鲜族',
  '满族',
  '侗族',
  '瑶族',
  '白族',
  '土家族',
  '哈尼族',
  '哈萨克族',
  '傣族',
  '黎族',
  '傈僳族',
  '佤族',
  '畲族',
  '高山族',
  '拉祜族',
  '水族',
  '东乡族',
  '纳西族',
  '景颇族',
  '柯尔克孜族',
  '土族',
  '达斡尔族',
  '仫佬族',
  '羌族',
  '布朗族',
  '撒拉族',
  '毛南族',
  '仡佬族',
  '锡伯族',
  '阿昌族',
  '普米族',
  '塔吉克族',
  '怒族',
  '乌孜别克族',
  '俄罗斯族',
  '鄂温克族',
  '德昂族',
  '保安族',
  '裕固族',
  '京族',
  '塔塔尔族',
  '独龙族',
  '鄂伦春族',
  '赫哲族',
  '门巴族',
  '珞巴族',
  '基诺族',
];

// 邮箱后缀列表
export const EMAIL_FILL = [
  'qq.com',
  '163.com',
  '126.com',
  'sina.com',
  'hotmail.com',
  'gmail.com',
  'sohu.com',
];

// 性别列表
export const SEX_LIST = ['--', '男', '女', '--'];

// 工作性质列表
export const WORK_TYPE_LIST = [
  '全职',
  '实习',
  '兼职',
  '劳务派遣',
  '劳务外包',
  '钟点工',
  '退休返聘',
  '无类型',
];

// 工作年限列表
export const WORK_NUM_LIST = ['全部', '1年以内', '1～3年', '3～5年', '5～10年', '10年以上'];



// 星级评分文案
export const STAR_TEXT = ['很差', '一般', '满意', '非常满意', '无可挑剔'];

// 证件类型
export const CARD_TYPE = ['身份证', '港澳居民来往内地通行证', '台湾人民来往大陆通行证', '外国护照'];
//政治面貌
export const PILITICAL_CLIMATE = ['党员', '团员', '群众', '其他'];

//婚姻状态列表
// export const MARRIAGE_STUATS = ['未婚', '已婚', '离异', '丧偶', '分居'];

//户口性质
// export const CENSUS_REGISTER = [
//   '本地城镇',
//   '本地农村',
//   '外地城镇（省内）',
//   '外地农村（省内）',
//   '外地城镇（省外)',
//   '外地农村（省外）',
// ];

//紧急联系人关系
// export const EMERGENEY_CONTACT = ['父母', '配偶', '子女', '亲属', '朋友', '同事', '其他'];




// 反馈状态文字
// export const STATUS_TEXT = ['已反馈', '部分反馈', '未反馈', '面试已取消'];
// 邮箱验证
export const REG_EMAIL = /\w[-\w.+]*@([A-Za-z0-9][-A-Za-z0-9]+\.)+[A-Za-z]{2,14}/g;
export const SUFFIX = ['vip.163.com', 'vip.126.com', '188.com', '163.com', '126.com', 'yeah.net'];








































